### Ex 1. For a given set of values in stats.xls that contains the list of employees, years of experience and their salary write a python script to calculate the mean, mode and median.

In [10]:
import pandas as pd
import numpy as np
import statistics

In [2]:
Emp_data = pd.read_excel('d://stats.xlsx')
Emp_data.head()

   Emp#  YearsOfExp  Salary in Rs.
0     1          10         126015
1     2           1          12598
2     3           8         100639
3     4          10         125351
4     5           2          25031

In [3]:
Emp_data.describe()

            Emp#  YearsOfExp  Salary in Rs.
count  25.000000   25.000000      25.000000
mean   13.000000    6.200000   77821.200000
std     7.359801    3.175426   39847.615281
min     1.000000    1.000000   12598.000000
25%     7.000000    3.000000   37592.000000
50%    13.000000    7.000000   87654.000000
75%    19.000000    9.000000  113112.000000
max    25.000000   10.000000  126015.000000

In [5]:
Emp_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Emp#           25 non-null     int64
 1   YearsOfExp     25 non-null     int64
 2   Salary in Rs.  25 non-null     int64
dtypes: int64(3)
memory usage: 728.0 bytes

In [6]:
Emp_data.mean()

Emp#                13.0
YearsOfExp           6.2
Salary in Rs.    77821.2
dtype: float64

In [7]:
Emp_data.median()

Emp#                13.0
YearsOfExp           7.0
Salary in Rs.    87654.0
dtype: float64

In [15]:
Emp_data.mode()

    Emp#  YearsOfExp  Salary in Rs.
0      1        10.0       100639.0
1      2         NaN            NaN
2      3         NaN            NaN
3      4         NaN            NaN
4      5         NaN            NaN
5      6         NaN            NaN
6      7         NaN            NaN
7      8         NaN            NaN
8      9         NaN            NaN
9     10         NaN            NaN
10    11         NaN            NaN
11    12         NaN            NaN
12    13         NaN            NaN
13    14         NaN            NaN
14    15         NaN            NaN
15    16         NaN            NaN
16    17         NaN            NaN
17    18         NaN            NaN
18    19         NaN            NaN
19    20         NaN            NaN
20    21         NaN            NaN
21    22         NaN            NaN
22    23         NaN            NaN
23    24         NaN            NaN
24    25         NaN            NaN

### Ex2. For the above exercise determine the standard deviation and variance through python scripting.

In [18]:
std = np.std(Emp_data)
print('standard Deviation :', std )

standard Deviation : Emp#                 7.211103
YearsOfExp           3.111270
Salary in Rs.    39042.529962
dtype: float64

In [19]:
Var = np.var(Emp_data)
print('Variance:', Var)

Variance: Emp#             5.200000e+01
YearsOfExp       9.680000e+00
Salary in Rs.    1.524319e+09
dtype: float64